# Sakila EDA - DuckDB + Pandas

In [1]:
import duckdb

con = duckdb.connect("../data/sakila.duckdb")
con.sql("SET search_path='staging';")
describe = con.sql("desc;").df()

In [2]:
describe

,database,schema,name,column_names,column_types,temporary
0,sakila,staging,_dlt_loads,"[load_id, schema_name, status, inserted_at, sc...","[VARCHAR, VARCHAR, BIGINT, TIMESTAMP WITH TIME...",False
1,sakila,staging,_dlt_pipeline_state,"[version, engine_version, pipeline_name, state...","[BIGINT, BIGINT, VARCHAR, VARCHAR, TIMESTAMP W...",False
2,sakila,staging,_dlt_version,"[version, engine_version, inserted_at, schema_...","[BIGINT, BIGINT, TIMESTAMP WITH TIME ZONE, VAR...",False
3,sakila,staging,actor,"[actor_id, first_name, last_name, last_update,...","[DECIMAL(38,9), VARCHAR, VARCHAR, TIMESTAMP, V...",False
4,sakila,staging,address,"[address_id, address, address2, district, city...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, BIGINT, VA...",False
5,sakila,staging,category,"[category_id, name, last_update, _dlt_load_id,...","[BIGINT, VARCHAR, TIMESTAMP, VARCHAR, VARCHAR]",False
6,sakila,staging,city,"[city_id, city, country_id, last_update, _dlt_...","[BIGINT, VARCHAR, BIGINT, TIMESTAMP, VARCHAR, ...",False
7,sakila,staging,country,"[country_id, country, last_update, _dlt_load_i...","[BIGINT, VARCHAR, TIMESTAMP, VARCHAR, VARCHAR]",False
8,sakila,staging,customer,"[customer_id, store_id, first_name, last_name,...","[BIGINT, BIGINT, VARCHAR, VARCHAR, VARCHAR, BI...",False
9,sakila,staging,film,"[film_id, title, description, release_year, la...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, BIGINT, BI...",False
10,sakila,staging,film_actor,"[actor_id, film_id, last_update, _dlt_load_id,...","[BIGINT, BIGINT, TIMESTAMP, VARCHAR, VARCHAR]",False
11,sakila,staging,film_category,"[film_id, category_id, last_update, _dlt_load_...","[BIGINT, BIGINT, TIMESTAMP, VARCHAR, VARCHAR]",False
12,sakila,staging,inventory,"[inventory_id, film_id, store_id, last_update,...","[BIGINT, BIGINT, BIGINT, TIMESTAMP, VARCHAR, V...",False
13,sakila,staging,language,"[language_id, name, last_update, _dlt_load_id,...","[BIGINT, VARCHAR, TIMESTAMP, VARCHAR, VARCHAR]",False
14,sakila,staging,payment,"[payment_id, customer_id, staff_id, rental_id,...","[BIGINT, BIGINT, BIGINT, BIGINT, DECIMAL(5,2),...",False
15,sakila,staging,rental,"[rental_id, rental_date, inventory_id, custome...","[BIGINT, TIMESTAMP, BIGINT, BIGINT, TIMESTAMP,...",False
16,sakila,staging,staff,"[staff_id, first_name, last_name, address_id, ...","[BIGINT, VARCHAR, VARCHAR, BIGINT, BLOB, VARCH...",False
17,sakila,staging,store,"[store_id, manager_staff_id, address_id, last_...","[BIGINT, BIGINT, BIGINT, TIMESTAMP, VARCHAR, V...",False

### a) Which movies are longer than three hours? (Showing title and length)

In [3]:
con.sql("""--sql
SELECT
    title,
    length
FROM film
WHERE length > 180
ORDER BY length DESC;
""").df()

                 title  length
0         WORST BANGER     185
1        CHICAGO NORTH     185
2       CONTROL ANTHEM     185
3       DARN FORRESTER     185
4    SWEET BROTHERHOOD     185
5          GANGS PRIDE     185
6            HOME PITY     185
7   SOLDIERS EVOLUTION     185
8         POND SEATTLE     185
9        MUSCLE BRIGHT     185
10     MOONWALKER FOOL     184
11      THEORY MERMAID     184
12   CONSPIRACY SPIRIT     184
13    CRYSTAL BREAKING     184
14      SORORITY QUEEN     184
15      SONS INTERVIEW     184
16     SMOOCHY CONTROL     184
17      KING EVOLUTION     184
18      YOUNG LANGUAGE     183
19       SCALAWAG DUCK     183
20      FRONTIER CABIN     183
21       CATCH AMISTAD     183
22           WIFE TURN     183
23       MONSOON CAUSE     182
24       RECORDS ZORRO     182
25          REDS POCUS     182
26         SATURN NAME     182
27      SEARCHERS WAIT     182
28     BAKED CLEOPATRA     182
29       LOVE SUICIDES     181
30      LAWLESS VISION     181
31  RUNAWAY TENENBAUMS     181
32       JACKET FRISCO     181
33      INTRIGUE WORST     181
34     HOTEL HAPPINESS     181
35    HAUNTING PIANIST     181
36      STAR OPERATION     181
37         WILD APOLLO     181
38    ANALYZE HOOSIERS     181

### b) Which movies have the word "love" in its title? (Showing title, rating, length, description)

In [4]:
con.sql("""--sql
SELECT
	title,
    rating,
    length,
    description
FROM
    film
WHERE
    title ILIKE '%love%';
""").df()

,title,rating,length,description
0,GRAFFITI LOVE,PG,117,A Unbelieveable Epistle of a Sumo Wrestler And...
1,IDAHO LOVE,PG-13,172,A Fast-Paced Drama of a Student And a Crocodil...
2,IDENTITY LOVER,PG-13,119,A Boring Tale of a Composer And a Mad Cow who ...
3,INDIAN LOVE,NC-17,135,A Insightful Saga of a Mad Scientist And a Mad...
4,LAWRENCE LOVE,NC-17,175,A Fanciful Yarn of a Database Administrator An...
5,LOVE SUICIDES,R,181,A Brilliant Panorama of a Hunter And a Explore...
6,LOVELY JINGLE,PG,65,A Fanciful Yarn of a Crocodile And a Forensic ...
7,LOVER TRUMAN,G,75,A Emotional Yarn of a Robot And a Boy who must...
8,LOVERBOY ATTACKS,PG-13,162,A Boring Story of a Car And a Butler who must ...
9,STRANGELOVE DESIRE,NC-17,103,A Awe-Inspiring Panorama of a Lumberjack And a...

### c) Longest, shortest, median and average length movies

In [5]:
con.sql("""--sql
    SELECT
        MIN(length) || ' ' || 'minutes' as shortest_movie,
        MAX(length) || ' ' || 'minutes'  as longest_movie,
        AVG(length)::INT || ' ' || 'minutes'  as average_movie_length,
        MEDIAN(length)::INT  || ' ' || 'minutes' as median_movie_length
    FROM
        film
""").df()

  shortest_movie longest_movie average_movie_length median_movie_length
0     46 minutes   185 minutes          115 minutes         114 minutes

### d) 10 most expensive movie to rent per day

In [6]:
rent_film = con.sql("""--sql
    SELECT
        title,
        release_year,
        description,
        (rental_rate / rental_duration) AS rent_per_day
    FROM film
    ORDER BY rent_per_day DESC
""").df()

rent_film.head(10)

,title,release_year,description,rent_per_day
0,PATHS CONTROL,2006,A Astounding Documentary of a Butler And a Cat...,1.663333
1,BACKLASH UNDEFEATED,2006,A Stunning Character Study of a Mad Scientist ...,1.663333
2,BEHAVIOR RUNAWAY,2006,A Unbelieveable Drama of a Student And a Husba...,1.663333
3,VIRTUAL SPOILERS,2006,A Fateful Tale of a Database Administrator And...,1.663333
4,TEEN APOLLO,2006,A Awe-Inspiring Drama of a Dog And a Man who m...,1.663333
5,TELEGRAPH VOYAGE,2006,A Fateful Yarn of a Husband And a Dog who must...,1.663333
6,BILKO ANONYMOUS,2006,A Emotional Reflection of a Teacher And a Man ...,1.663333
7,HEARTBREAKERS BRIGHT,2006,A Awe-Inspiring Documentary of a A Shark And a...,1.663333
8,CLERKS ANGELS,2006,A Thrilling Display of a Sumo Wrestler And a G...,1.663333
9,TIES HUNGER,2006,A Insightful Saga of a Astronaut And a Explore...,1.663333

### e) Actor who played in most movies

In [7]:
actors_in_movies = con.sql("""--sql
SELECT
	a.first_name || ' ' || a.last_name AS actor_name,
    f.title,
FROM
    actor a
LEFT JOIN film_actor fa ON fa.actor_id = a.actor_id
LEFT JOIN film f ON f.film_id = fa.film_id;
""").df()

actors_in_movies["actor_name"].value_counts().head(5)

actor_name
SUSAN DAVIS       54
GINA DEGENERES    42
WALTER TORN       41
MARY KEITEL       40
MATTHEW CARREY    39
Name: count, dtype: int64

### f) Adding some interesting insights on my own (with a little help from my friend ChatGPT)

#### f.1) What movie categories are most rented?

In [ ]:
con.sql("""--sql
    SELECT
    c.name AS category,
    COUNT(r.rental_id) AS total_rentals
    FROM
    category c
    JOIN film_category fc ON fc.category_id = c.category_id
    JOIN film f ON f.film_id = fc.film_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY c.name
    ORDER BY total_rentals DESC
    LIMIT 10;
    """).df()

      category  total_rentals
0       Sports           1179
1    Animation           1166
2       Action           1112
3       Sci-Fi           1101
4       Family           1096
5        Drama           1060
6  Documentary           1050
7      Foreign           1033
8        Games            969
9     Children            945

#### f.2) Which customers are most active overall and per month?

In [9]:
con.sql("""--sql
    SELECT
    cu.first_name || ' ' || cu.last_name as customer,
    COUNT(r.rental_id) AS total_rentals
    FROM
    customer cu
    JOIN rental r ON r.customer_id = cu.customer_id
    GROUP BY cu.first_name, cu.last_name
    ORDER BY total_rentals DESC
    LIMIT 10;
    """).df()

         customer  total_rentals
0    ELEANOR HUNT             46
1       KARL SEAL             45
2      CLARA SHAW             42
3     MARCIA DEAN             42
4   TAMMY SANDERS             41
5     WESLEY BULL             40
6      SUE PETERS             40
7        TIM CARY             39
8   MARION SNYDER             39
9  RHONDA KENNEDY             39

In [12]:
per_month = con.sql("""--sql
    SELECT
		DATE_TRUNC('month', rental_date) AS rental_month,
        cu.first_name || ' ' || cu.last_name AS customer,
        COUNT(*) AS monthly_rentals
        FROM rental r
        JOIN customer cu ON cu.customer_id = r.customer_id
        GROUP BY rental_month, customer
    """).df()

per_month.sample(10)

     rental_month         customer  monthly_rentals
1934   2005-07-01      NEIL RENNER               14
1058   2005-08-01    BRANDY GRAVES               12
1286   2005-06-01   GILBERT SLEDGE                4
1702   2005-05-01     DEBBIE REYES                1
1822   2005-08-01     LESTER KRAUS                4
789    2005-05-01       TRACY COLE                2
2109   2005-07-01  HARVEY GUAJARDO               10
1778   2005-08-01       JOSEPH JOY                7
2073   2005-07-01    ARNOLD HAVENS               18
771    2005-08-01     GUY BROWNLEE               13

In [16]:
top_per_month = (
    per_month.sort_values(["rental_month", "monthly_rentals"], ascending=[True, False])
    .groupby("rental_month")
    .head(3)
)
top_per_month

     rental_month         customer  monthly_rentals
1999   2005-05-01       SUE PETERS                8
616    2005-05-01    LESLIE SEWARD                7
2006   2005-05-01        EDNA WEST                7
1890   2005-06-01    BRENDA WRIGHT               11
510    2005-06-01     ALEX GRESHAM               10
814    2005-06-01   FRANK WAGGONER                9
715    2005-07-01     ELEANOR HUNT               22
1605   2005-07-01     CRYSTAL FORD               21
220    2005-07-01      MARCIA DEAN               20
138    2005-08-01    DAVE GARDINER               18
768    2005-08-01     HELEN HARRIS               18
1062   2005-08-01     ELEANOR HUNT               18
1983   2006-02-01    TAMMY SANDERS                3
133    2006-02-01    ANNETTE OLSON                2
282    2006-02-01  MORRIS MCCARTER                2

#### f.3) Which films generate the highest total revenue?

In [21]:
con.sql("""--sql
    SELECT
    f.title,
    SUM(p.amount) AS total_amount
    FROM film f
    JOIN inventory i ON i.film_id = f.film_id
    JOIN rental r ON r.inventory_id = i.inventory_id
    JOIN payment p ON p.rental_id = r.rental_id
    GROUP BY f.title
    ORDER BY total_amount DESC
    LIMIT 10;
        """).df()

               title  total_amount
0   TELEGRAPH VOYAGE        231.73
1          WIFE TURN        223.69
2          ZORRO ARK        214.69
3  GOODFELLAS SALUTE        209.69
4     SATURDAY LAMBS        204.72
5        TITANS JERK        201.71
6       TORQUE BOUND        198.72
7        HARRY IDAHO        195.70
8     INNOCENT USUAL        191.74
9      HUSTLER PARTY        190.78

#### f.4) Which categories have the longest average film length?

In [26]:
con.sql("""--sql
    SELECT
    c.name AS category,
    AVG(f.length)::INT AS average_movie_length
    FROM
    category c
    JOIN film_category fc ON fc.category_id = c.category_id
    JOIN film f ON f.film_id = fc.film_id
    GROUP BY category
    ORDER BY average_movie_length DESC
    LIMIT 10;
    """).df()

   category  average_movie_length
0     Games                   128
1    Sports                   128
2   Foreign                   122
3     Drama                   121
4    Comedy                   116
5    Family                   115
6     Music                   114
7    Travel                   113
8    Horror                   112
9  Classics                   112

#### f.5) Which store is no. 1 in rentals and revenue?

In [37]:
con.sql("""--sql
    SELECT
    s.store_id,
    COUNT(r.rental_id) as total_rental,
    SUM(p.amount) as total_revenue
    FROM
    store s
    JOIN customer cu ON cu.store_id = s.store_id
    JOIN rental r ON r.customer_id = cu.customer_id
    JOIN payment p ON p.rental_id = r.rental_id
    GROUP BY
    s.store_id
    ORDER BY total_revenue DESC;
        """).df()

   store_id  total_rental  total_revenue
0         1          8747       36997.53
1         2          7297       30409.03